tutorials/sideInjection/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;

        smoothLimiter   0.1;

        implicitPhasePressure yes;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
        maxIter         12;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

/*    "U.*"*/
/*    {*/
/*        solver          smoothSolver;*/
/*        smoother        symGaussSeidel;*/
/*        tolerance       1e-5;*/
/*        relTol          0;*/
/*        minIter         1;*/
/*    }*/

/*    "(h|e).*"*/
/*    {*/
/*        solver          smoothSolver;*/
/*        smoother        symGaussSeidel;*/
/*        tolerance       1e-6;*/
/*        relTol          0;*/
/*        minIter         1;*/
/*    }*/

/*    "Theta.*"*/
/*    {*/
/*        solver          smoothSolver;*/
/*        smoother        symGaussSeidel;*/
/*        tolerance       1e-6;*/
/*        relTol          0;*/
/*        minIter         1;*/
/*    }*/

/*    "(k|epsilon).*"*/
/*    {*/
/*        solver          smoothSolver;*/
/*        smoother        symGaussSeidel;*/
/*        tolerance       1e-5;*/
/*        relTol          0;*/
/*        minIter         1;*/
/*    }*/
}

PIMPLE
{
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}


// ************************************************************************* //
